---
kind: enumMember
id: F:Autodesk.Revit.DB.AllowedValues.All
enum: Autodesk.Revit.DB.AllowedValues
source: html/a777713f-d3be-3c45-29ee-09f9c7a83d9f.htm
---
# Autodesk.Revit.DB.AllowedValues.All

All values are allowed.